## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_record._autodiscover_tcp: Refreshing state... [id=152e2e33d0bd2d72dfa140bb525f829f]
cloudflare_record.pop3: Refreshing state... [id=82cb3cd742c7d05bc2d03f25c59c82c3]
cloudflare_record.www-aaaa: Refreshing state... [id=42ee94b3fab962b8b21d1487ec734fbd]
cloudflare_record.webmail: Refreshing state... [id=457b0a51b6b0d9041801788e0dfd917f]
cloudflare_record.root-aaaa: Refreshing state... [id=5c120446a4bc1a2fb3eb480206844313]
cloudflare_record.imap: Refreshing state... [id=ac6aeafd9af224e07c88efdc9b5e4887]
cloudflare_record.autoconfig: Refreshing state... [id=db6141ae25d9723d0cd72ff53df130e7]
cloudflare_record.mail2: Refreshing state... [id=60581cadb658f04d4d94bae9c8bfbbae]
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
cloudflare_record.mail: Refreshing state... [id=f9cff3da6c43997e0e9eacaac8fbb589]
cloudflare_record.mx-2: Refreshing state... [id=faafcadfad83b1236f4c929db14f3d18]
cloudflare_record.root-a: Refreshing state... [id=9baadb4a0bef6e6e9e3fa50ab2bfe2c1]
cloudflare_record.smtp: Refreshing state... [id=5f6a7752e884e3c824aae558732f2fd0]
cloudflare_record.webbmail: Refreshing state... [id=103b1308497abba1cb8bcc4af7c5264f]
cloudflare_record.www-a: Refreshing state... [id=5d3ab468a74e6757b07c36226406b661]
cloudflare_record.mx-1: Refreshing state... [id=7f7e451868fc1ffe53a7de678eb3bc93]
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
tls_private_key.terraform_access: Refreshing state... [id=ca7f120683c884d7607764350d41aebb404d6c46]
hcloud_server.testnode: Refreshing state... [id=24922878]
cloudflare_record.node1: Refreshing state... [id=db1e5ed222e96cdf5bff675f30815bfe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.node1 will be updated in-place
  ~ resource "cloudflare_record" "node1" {
        id              = "db1e5ed222e96cdf5bff675f30815bfe"
        name            = "node1"
      ~ value           = "2a01:4f9:c012:6063::1" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # hcloud_server.testnode must be replaced
-/+ resource "hcloud_server" "testnode" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "hel1-dc2" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "24922878" -> (known after apply)
      ~ ipv4_address               = "65.21.188.62" -> (known after apply)
      ~ ipv6_address               = "2a01:4f9:c012:6063::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f9:c012:6063::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "testnode"
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "KnhFKJK4paF+5fVK+fsoz/NeKYU=" -> "jz6t4L62WkxOi3FCMJjyXMwNM+o=" # forces replacement
        # (9 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*